#######################################################
#apply함수
#apply함수는 행렬의 행 또는 열 방향으로 특정 함수 적용
#######################################################

test <- matrix(1:12, ncol = 3)
apply(test, 1, sum) #두번째 인자는 행과 열의 방향을 의미 1은 행, 2는 열

#data.frame도 적용 가능한지 테스트
df_test <- as.data.frame(test)
df_test
apply(df_test, 1, sum) #matrix와 동일한 결과 

#######################################################
#lpply함수
#lpply함수는 벡터, 리스트 함수 적용한 뒤에 리스트로 반환
#######################################################

test2 <- c(5,23,3,1,5,2)
test2 <- lapply(test2, function(x){x*10})
unlist(test2)

lapply(test2, nchar)

#######################################################
#spply함수
#lappy와 비슷하지만 행렬 혹은 벡터 등의 데이터 타입으로 반환
#######################################################

x <- sapply(iris[,1:4], mean)
as.data.frame(x)
as.data.frame(t(x))

sapply(iris, class) #각 칼럼의 데이터 타입 확인 

y <- sapply(iris[,1:4], function(X){x > 3})
y
